{"name":"promptcloud_world-happiness-report-2019","title":"World Happiness Report 2019","description":"World happiness gauged by technologies, social norms, and government policies.\n\nThe data has been released by SDSN and extracted by [PromptCloud](https://www.promptcloud.com/)'s custom web crawling solution.\n\n### **Context**\nThe World Happiness Report is a landmark survey of the state of global happiness that ranks 156 countries by how happy their citizens perceive themselves to be. This year’s World Happiness Report focuses on happiness and the community: how happiness has evolved over the past dozen years, with a focus on the technologies, social norms, conflicts and government policies that have driven those changes.\n\n### **Content**\n**What is Dystopia?**\n\nDystopia is an imaginary country that has the world’s least-happy people. The purpose in establishing Dystopia is to have a benchmark against which all countries can be favorably compared (no country performs more poorly than Dystopia) in terms of each of the six key variables, thus allowing each sub-bar to be of positive (or zero, in six instances) width. The lowest scores observed for the six key variables, therefore, characterize Dystopia. Since life would be very unpleasant in a country with the world’s lowest incomes, lowest life expectancy, lowest generosity, most corruption, least freedom, and least social support, it is referred to as “Dystopia,” in contrast to Utopia.\n\n**What are the residuals?**\n\nThe residuals, or unexplained components, differ for each country, reflecting the extent to which the six variables either over- or under-explain average 2016-2018 life evaluations. These residuals have an average value of approximately zero over the whole set of countries. Figure 2.7 shows the average residual for each country if the equation in Table 2.1 is applied to average 2016- 2018 data for the six variables in that country. We combine these residuals with the estimate for life evaluations in Dystopia so that the combined bar will always have positive values. As can be seen in Figure 2.7, although some life evaluation residuals are quite large, occasionally exceeding one point on the scale from 0 to 10, they are always much smaller than the calculated value in Dystopia, where the average life is rated at 1.88 on the 0 to 10 scale. Table 7 of the online Statistical Appendix 1 for Chapter 2 puts the Dystopia plus residual block at the left side, and also draws the Dystopia line, making it easy to compare the signs and sizes of the residuals in different countries.\n\n**Why do we use these six factors to explain life evaluations?**\n\nThe variables used reflect what has been broadly found in the research literature to be important in explaining national-level differences in life evaluations. Some important variables, such as unemployment or inequality, do not appear because comparable international data are not yet available for the full sample of countries. The variables are intended to illustrate important lines of correlation rather than to reflect clean causal estimates, since some of the data are drawn from the same survey sources, some are correlated with each other (or with other important factors for which we do not have measures), and in several instances there are likely to be two-way relations between life evaluations and the chosen variables (for example, healthy people are overall happier, but as Chapter 4 in the World Happiness Report 2013 demonstrated, happier people are overall healthier). In Statistical Appendix 1 of World Happiness Report 2018, we assessed the possible importance of using explanatory data from the same people whose life evaluations are being explained. We did this by randomly dividing the samples into two groups, and using the average values for .e.g. freedom gleaned from one group to explain the life evaluations of the other group. This lowered the effects, but only very slightly (e.g. 2% to 3%), assuring us that using data from the same individuals is not seriously affecting the results.\n\nData source: [http://worldhappiness.report/ed/2019/](http://worldhappiness.report/ed/2019/)","homepage":"https://data.world/promptcloud/world-happiness-report-2019","license":"Public Domain","resources":[{"name":"world_happiness_report_2019","schema":{"fields":[{"name":"country_region","title":"Country (region)","description":"Name of the country.","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"country_region"},{"name":"ladder","title":"Ladder","description":"Cantril Ladder is a measure of life satisfaction.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"ladder"},{"name":"sd_of_ladder","title":"SD of Ladder","description":"Standard deviation of the ladder.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"sd_of_ladder"},{"name":"positive_affect","title":"Positive affect","description":"Measure of positive emotion.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"positive_affect"},{"name":"negative_affect","title":"Negative affect","description":"Measure of negative emotion.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"negative_affect"},{"name":"social_support","title":"Social support","description":"The extent to which Social support contributed to the calculation of the Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"social_support"},{"name":"freedom","title":"Freedom","description":"The extent to which Freedom contributed to the calculation of the Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"freedom"},{"name":"corruption","title":"Corruption","description":"The extent to which Perception of Corruption contributes to Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"corruption"},{"name":"generosity","title":"Generosity","description":"The extent to which Generosity contributed to the calculation of the Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"generosity"},{"name":"log_of_gdp_per_capita","title":"Log of GDP\nper capita","description":"The extent to which GDP contributes to the calculation of the Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"log_of_gdp_per_capita"},{"name":"healthy_life_expectancy","title":"Healthy life\nexpectancy","description":"The extent to which Life expectancy contributed to the calculation of the Happiness Score.","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"healthy_life_expectancy"}]},"path":"data/world_happiness_report_2019.csv","format":"csv"},{"name":"original/world-happiness-report-2019.csv","path":"original/world-happiness-report-2019.csv","format":"csv","mediatype":"text/csv","bytes":6849}],"keywords":["emotion","economics","social sciences","geospatial analysis"]}